#!/usr/bin/python3
from vakhr_split_lines import *

tests = [
    [
        '''рохтаӈкве застӓвить кричӓть /а°ййәл'тӓх, ӓ ййәптӓх рохтасьлаӈгкве робёть /пәл’х, рөхтәщлӓх''',
        [6]
    ],
    [
        '''русь юнтуп булӓвка'рөщйук-тэп, булавкә рут родня /рөт, өймәх рут нэ родственница /рөт не, оймәх не''',
        [4, 8]
    ],
    [
        '''сайт II чӱвство /сӓс йт, сӓ тэл’ сайт III прут, хворостйна /сӓйт, өщтэр''',
        [7]
    ],
    [
        '''сакпакыг бёрежно, аккурӓтно, опрятно /сӓхпӓкәй, сӓх-пӓхәй; сӓхпӓхәнәй, сӓхпӓх-әӈәй''',
        []
    ],
    [
        '''ома мӓма /щук, щух ониг 1. мӓчеха; 2. снохӓ /ен'әй, ун'әй''',
        [4]
    ],
    [
        '''паквкер скорлупӓ кёдрового орёха /пӓ°ккер, пӓ°хкерп; пӓ°кхөсп, пӓ°ххөсп паквсам орёх (кёдровый) /пӓ°ксӓм, пӓ°хсӓм''',
        [8]
    ]
]

correct = 0
wrong = []
for e, test in enumerate(tests):
    result = SplitString(test[0]).get_split_positions()
    print("{})".format(e + 1), test[1], '<==>', result)
    if result == test[1]:
        correct += 1
    else:
        wrong.append(e)

print('{} out of {}'.format(correct, len(tests)))
print('wrong tests:', ', '.join([str(x + 1) for x in wrong]))
