#!/usr/bin/python3
from vakhr_split_lines import *

tests = [
    [
        '''рохтаӈкве застӓвить кричӓть /а°ййәл'тӓх, ӓ ййәптӓх рохтасьлаӈгкве робёть /пәл’х, рөхтәщлӓх''',
        [6]
    ],
    [
        '''русь юнтуп булӓвка'рөщйук-тэп, булавкә рут родня /рөт, өймәх рут нэ родственница /рөт не, оймәх не''',
        [4, 8]
    ],
    [
        '''сайт II чӱвство /сӓс йт, сӓ тэл’ сайт III прут, хворостйна /сӓйт, өщтэр''',
        [7]
    ],
    [
        '''сакпакыг бёрежно, аккурӓтно, опрятно /сӓхпӓкәй, сӓх-пӓхәй; сӓхпӓхәнәй, сӓхпӓх-әӈәй''',
        []
    ],
    [
        '''ома мӓма /щук, щух ониг 1. мӓчеха; 2. снохӓ /ен'әй, ун'әй''',
        [4]
    ],
    [
        '''паквкер скорлупӓ кёдрового орёха /пӓ°ккер, пӓ°хкерп; пӓ°кхөсп, пӓ°ххөсп паквсам орёх (кёдровый) /пӓ°ксӓм, пӓ°хсӓм''',
        [8]
    ],
    [
        '''патыртаӈкве скрыть /па тәр-тӓх, па°трәйтӓх пахвтуӈкве метӓть, кидӓть /пахтәх''',
        [5]
    ],
    [
        '''хоттимат I какой-нибудь /хӓ°т'әймӓт, ха°т'имӓт, ӓ° лхөтмӓт''',
        []
    ],
    [
        '''юв-аялаӈкве выпить зӓлпом, проглотйть /йувӓйәл’ӓх, йув-н'ӓ°л’тәмтӓх, йув-н'ӓ л’тэйл’ӓх юв-ванттаӈкве ввестй /йув-вӓ°нттӓх юв-ваӈкуӈкве вползтй /йув-вӓ ӈкдх юв-ватуӈкве съесть (о мед-вёд е) /йув-тех''',
        [11, 15]
    ],
    [
        '''сивгын суй свист, завывӓнье (вётра) 'щәвйән сөй сивралтаӈкве производйть шброх, шелестёть /щәврәл’-тӓх, щәмрәл’тӓх |''',
        [7]
    ],
    [
        '''сакпакыг бёрежно, аккурӓтно, опрятно /сӓхпӓкәй, сӓх-пӓхәй; сӓхпӓхәнәй, сӓхпӓх-әӈәй''',
        []
    ],
    [
        '''варылтан вармаль закӓз /вӓ°-рәл’тӓнӓщ, вӓ°рәл’тӓп варылтаӈкве заказӓть сдёлать что-л . /еӓ°рәл’тӓх варылтаптуӈкве попросйть кого-л. йли чёрез кого-л. сдёлать что-н . /вӓ°рәл’тӓп-тәх''',
        [5, 11]
    ]
]

correct = 0
wrong = []
for e, test in enumerate(tests):
    result = SplitString(test[0]).get_split_positions()
    print("{})".format(e + 1), test[1], '<==>', result)
    if result == test[1]:
        correct += 1
    else:
        wrong.append(e)

print('{} out of {}'.format(correct, len(tests)))
print('wrong tests:', ', '.join(['N' + str(x + 1) for x in wrong]))
