{"title": "Мньщи лтыӈ хт ханищтаве", "url": "http://www.khanty-yasang.ru/luima-seripos/no-19-1061/1090", "content": {"correct": [" Ха̄льӯс районт ма̄нь-щи ла̄тыӈ ханищтан ня̄врамыт пуссын аквъёт ловиньтаӈкв те, атса̄т ня̄врам ат е̄мты. Саранпа̄вылт, Кульпаст, Ня̄хщамво̄льт, Во-сыӈтӯрт, Кимкъясӯйт, Ло̄пмуст ос Сӯкыръят о̄лнэ ня̄врамыт туп тот ща̄нь ла̄тӈыл по-тыртаӈкв ханищтавет. Са̄выӈпа̄лэ ма̄ньщи ма̄х-манув тот ты о̄лэ̄гыт. Кондинский районт о̄с ма̄хманув кос о̄лэ̄гыт, ос тот туп Шугур па̄выл школат о̄выл классытт хусахтем ня̄врам потыр-таӈкв ханищтавет. Яныг классыт ла̄тыӈ щар ат ханищтаве. Нижневартовский районт Сосновоборск па̄выл о̄лы. Ты па̄выл наме ат хӯлыгласлӯв, ос ма̄ньщиянув та палыт ма̄н о̄с о̄лмыгтамыт. Тот ос нила ня̄врам ма̄ньщи ла̄тӈын ханищтавет. Октябрьский районт Лӯи Ня̄рихуми па̄вылт о̄с са̄в ма̄ньщит о̄лэ̄гыт. Ня̄врамыт школат Лариса Николаевна Карпенкан ос Клавдия Семеновна Плеханован ханищтавет, пуссын аквъёт атпан ня̄врам ат е̄мты. Округув янытыл лов школатт ня̄врамыт ма̄ньщи ла̄тӈыл по-тыртаӈкв ханищтавет, 16 школатт – ханты ла̄тӈын, 1 школат – ё̄рн ла̄тӈын, ос Саранпа̄выл школат – иӈ саран ла̄тӈын. Хӯрум со̄тыра арыгтем ня̄врам та̄нти ща̄нь ла̄тӈаныл ханищтыяныл, та̄н халанылт акв со̄тыра арыгтем – ты ма̄ньщи ня̄врамыт. Тыг школан, садикн ос образовательный центрытн ялантан ня̄врамыт пуссын ловиньтаве̄сыт. Ты ня̄врамыт округ образование департаментыт рӯпитан ма̄хумн ловиньтаве̄сыт. Ос ма̄ньщи ла̄тӈыл потыртан ка̄сыӈ хо̄тпа ва̄гтэ – ань яныгман ня̄врамыт, ма̄ньлат хо̄тпат халт янгыщ нэ̄мхотьют потыртаӈкв ат ве̄рми. Туп то̄ва ма̄нь па̄влытт о̄лнэ акв-тит ще̄мьят ня̄враманыл потыртаӈкв ха̄сэ̄гыт. "], "defective": []}}